import os
import time
from io import StringIO

import streamlit as st


st.title("🕵️‍♂️ Object Detection APP")
st.text("Финальный проект курса Deep Learning School. ")
st.text("Приложение позволяет детектировать объекты на изображениях и видео.")

st.markdown("## 🧭 Навигация по приложению")
st.text("1️⃣ About APP - стартовая страница и описание возможностей приложения.")
st.text("2️⃣ Intro Demo - демо возможностей приложения на тестовых кейсах.")
st.text("3️⃣ Image Detection - пользовательская страница для загрузки детектируемых изображений.")
st.text("4️⃣ Video Detection - пользовательская страница для загрузки детектируемого видео.")
